
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to import, 3 to add, 4 to change, 3 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.POSTGRES_HOST
  * module.lau-case-db-flexible.azurerm_monitor_metric_alert.db_alert_cpu[0]
  * module.lau-case-db-flexible.azurerm_monitor_metric_alert.db_alert_memory[0]
  * module.lau-case-db-flexible.azurerm_monitor_metric_alert.db_alert_storage_utilization[0]
* Replace
  * module.lau-case-db-flexible.azurerm_postgresql_flexible_server.pgsql_server
  * module.lau-case-db-flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;azure.extensions&#34;]
  * module.lau-case-db-flexible.azurerm_postgresql_flexible_server_database.pg_databases[&#34;lau_case&#34;]
* Import
  * module.lau-case-db-flexible.azurerm_postgresql_flexible_server.pgsql_server
  * module.lau-case-db-flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;azure.extensions&#34;]
  * module.lau-case-db-flexible.azurerm_postgresql_flexible_server_database.pg_databases[&#34;lau_case&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES_HOST will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
        id                      = "https://lau-prod.vault.azure.net/secrets/case-backend-POSTGRES-HOST/103890a456774e1f82b1f447dcf62324"
        name                    = "case-backend-POSTGRES-HOST"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (8 unchanged attributes hidden)
    }

  # module.lau-case-db-flexible.azurerm_monitor_metric_alert.db_alert_cpu[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "db_alert_cpu" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/lau-case-backend-flexible-data-prod/providers/Microsoft.Insights/metricAlerts/db_cpu_percent_lau-case-backend-flexible-prod"
        name                     = "db_cpu_percent_lau-case-backend-flexible-prod"
      ~ scopes                   = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/lau-case-backend-flexible-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/lau-case-backend-flexible-prod",
        ] -> (known after apply)
        tags                     = {
            "application"         = "log-and-audit"
            "builtFrom"           = "https://github.com/HMCTS/lau-case-backend.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#lau-dev"
            "environment"         = "production"
            "managedBy"           = "LAU"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.lau-case-db-flexible.azurerm_monitor_metric_alert.db_alert_memory[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "db_alert_memory" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/lau-case-backend-flexible-data-prod/providers/Microsoft.Insights/metricAlerts/db_memory_percent_lau-case-backend-flexible-prod"
        name                     = "db_memory_percent_lau-case-backend-flexible-prod"
      ~ scopes                   = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/lau-case-backend-flexible-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/lau-case-backend-flexible-prod",
        ] -> (known after apply)
        tags                     = {
            "application"         = "log-and-audit"
            "builtFrom"           = "https://github.com/HMCTS/lau-case-backend.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#lau-dev"
            "environment"         = "production"
            "managedBy"           = "LAU"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.lau-case-db-flexible.azurerm_monitor_metric_alert.db_alert_storage_utilization[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "db_alert_storage_utilization" {
        id                       = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/lau-case-backend-flexible-data-prod/providers/Microsoft.Insights/metricAlerts/db_storage_utilization_lau-case-backend-flexible-prod"
        name                     = "db_storage_utilization_lau-case-backend-flexible-prod"
      ~ scopes                   = [
          - "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/lau-case-backend-flexible-data-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/lau-case-backend-flexible-prod",
        ] -> (known after apply)
        tags                     = {
            "application"         = "log-and-audit"
            "builtFrom"           = "https://github.com/HMCTS/lau-case-backend.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#lau-dev"
            "environment"         = "production"
            "managedBy"           = "LAU"
        }
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.lau-case-db-flexible.azurerm_postgresql_flexible_server.pgsql_server must be replaced
  # (imported from "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-case-backend-flexible-data-demo/providers/Microsoft.DBforPostgreSQL/flexibleServers/lau-case-backend-flexible-demo")
  # Warning: this will destroy the imported resource
-/+ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
        administrator_login               = "lauadmin"
      + administrator_password            = (sensitive value)
        administrator_password_wo         = (write-only attribute)
      - administrator_password_wo_version = 0 -> null
        auto_grow_enabled                 = true
        backup_retention_days             = 35
      + create_mode                       = "Default"
      ~ delegated_subnet_id               = "/subscriptions/d025fece-ce99-4df2-b7a9-b649d3ff2060/resourceGroups/cft-demo-network-rg/providers/Microsoft.Network/virtualNetworks/cft-demo-vnet/subnets/postgresql" -> "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/virtualNetworks/cft-prod-vnet/subnets/postgresql" # forces replacement
      ~ fqdn                              = "lau-case-backend-flexible-demo.postgres.database.azure.com" -> (known after apply)
        geo_redundant_backup_enabled      = false
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-case-backend-flexible-data-demo/providers/Microsoft.DBforPostgreSQL/flexibleServers/lau-case-backend-flexible-demo" -> (known after apply)
        location                          = "uksouth"
      ~ name                              = "lau-case-backend-flexible-demo" -> "lau-case-backend-flexible-prod" # forces replacement
        private_dns_zone_id               = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
        public_network_access_enabled     = false
        replication_role                  = null
      ~ resource_group_name               = "lau-case-backend-flexible-data-demo" -> "lau-case-backend-flexible-data-prod" # forces replacement
        sku_name                          = "GP_Standard_D2s_v3"
      ~ storage_mb                        = 131072 -> 262144
      ~ storage_tier                      = "P10" -> (known after apply)
      ~ tags                              = {
            "application"         = "log-and-audit"
          - "autoShutdown"        = "true" -> null
            "builtFrom"           = "https://github.com/HMCTS/lau-case-backend.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#lau-dev"
          ~ "environment"         = "demo" -> "production"
            "managedBy"           = "LAU"
        }
        version                           = "15"
      - zone                              = "1" -> null

        authentication {
            active_directory_auth_enabled = true
            password_auth_enabled         = true
            tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        }

      + high_availability {
          + mode = "ZoneRedundant"
        }

        maintenance_window {
            day_of_week  = 0
            start_hour   = 3
            start_minute = 0
        }
    }

  # module.lau-case-db-flexible.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["azure.extensions"] must be replaced
  # (imported from "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-case-backend-flexible-data-demo/providers/Microsoft.DBforPostgreSQL/flexibleServers/lau-case-backend-flexible-demo/configurations/azure.extensions")
  # Warning: this will destroy the imported resource
-/+ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      ~ id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-case-backend-flexible-data-demo/providers/Microsoft.DBforPostgreSQL/flexibleServers/lau-case-backend-flexible-demo/configurations/azure.extensions" -> (known after apply)
        name      = "azure.extensions"
      ~ server_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/lau-case-backend-flexible-data-demo/providers/Microsoft.DBforPostgreSQL/flexibleServers/lau-case-backend-flexible-demo" -> (known after apply) # forces replacement
        value     = "pg_stat_statements,pg_buffercache,pgcrypto,hypopg"
    }

  # module.lau-case-db-flexible.azurerm_postgresql_flexible_server_database.pg_databases["lau_case"] must be replaced
  # (imported from "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-case-backend-flexible-data-demo/providers/Microsoft.DBforPostgreSQL/flexibleServers/lau-case-backend-flexible-demo/databases/lau_case")
  # Warning: this will destroy the imported resource
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
        collation = "en_GB.utf8"
      ~ id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/lau-case-backend-flexible-data-demo/providers/Microsoft.DBforPostgreSQL/flexibleServers/lau-case-backend-flexible-demo/databases/lau_case" -> (known after apply)
        name      = "lau_case"
      ~ server_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/lau-case-backend-flexible-data-demo/providers/Microsoft.DBforPostgreSQL/flexibleServers/lau-case-backend-flexible-demo" -> (known after apply) # forces replacement
    }

Plan: 3 to import, 3 to add, 4 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1043,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->